#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cloudsbits/audiotube-sandbox/runs/run-q6EZUhMLFHVwegWT

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.org: Refreshing...
data.terraform_remote_state.org: Refresh complete after 1s
module.ecr_registry.data.aws_partition.current: Refreshing...
module.ecr_disabled.data.aws_partition.current: Refreshing...
module.ecr_registry.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.ecr.data.aws_partition.current: Refreshing...
data.aws_caller_identity.current: Refreshing...
module.ecr.data.aws_caller_identity.current: Refreshing...
data.aws_partition.current: Refreshing...
module.ecr_registry.data.aws_caller_identity.current: Refreshing...
module.ecr_registry.aws_ecr_registry_scanning_configuration.this[0]: Refreshing state... [id=257625454150]
module.ecr.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.ecr.aws_ecr_repository.this[0]: Refreshing state... [id=cloudsbits-audiotube-sandbox]
module.ecr_disabled.data.aws_caller_identity.current: Refreshing...
module.ecr_disabled.data.aws_partition.current: Refresh complete after 0s [id=aws]
data.aws_partition.current: Refresh complete after 0s [id=aws]
module.ecr_registry.data.aws_caller_identity.current: Refresh complete after 0s [id=257625454150]
data.aws_caller_identity.current: Refresh complete after 0s [id=257625454150]
module.ecr_disabled.data.aws_caller_identity.current: Refresh complete after 0s [id=257625454150]
module.ecr.data.aws_caller_identity.current: Refresh complete after 0s [id=257625454150]
module.ecr.data.aws_iam_policy_document.repository[0]: Refreshing...
module.ecr.data.aws_iam_policy_document.repository[0]: Refresh complete after 0s [id=933275252]
module.ecr.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=cloudsbits-audiotube-sandbox]
module.ecr.aws_ecr_repository_policy.this[0]: Refreshing state... [id=cloudsbits-audiotube-sandbox]
data.aws_iam_policy_document.registry: Refreshing...
data.aws_iam_policy_document.registry: Refresh complete after 0s [id=2876457901]
module.ecr_registry.aws_ecr_registry_policy.this[0]: Refreshing state... [id=257625454150]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.github_allow will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github_allow" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:Kostua/audiotube:ref:refs/heads/main",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # aws_iam_openid_connect_provider.github_oidc will be created
  + resource "aws_iam_openid_connect_provider" "github_oidc" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "a031c46782e6e6c662c2c87c76da9aa62ccabd8e",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # aws_iam_role.github_role will be created
  + resource "aws_iam_role" "github_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GithubActionsRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.ecr.aws_ecr_repository_policy.this[0] will be updated in-place
  ~ resource "aws_ecr_repository_policy" "this" {
        id          = "cloudsbits-audiotube-sandbox"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:sts::257625454150:assumed-role/Org-Admin/aws-go-sdk-1689611108418726299" -> "arn:aws:sts::257625454150:assumed-role/Org-Admin/aws-go-sdk-1689656310555989918"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:sts::257625454150:assumed-role/Org-Admin/aws-go-sdk-1689611108418726299" -> "arn:aws:sts::257625454150:assumed-role/Org-Admin/aws-go-sdk-1689656310555989918"
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 4 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @Kostua, Action: `pull_request`*